# Pandas
데이터 처리를 위한 라이브러리
* 저수준 API가 대부분인 Numpy는 데이터 핸드링을 하기 어렵다.
* Pandas는 데이터를 DataFrame으로 변경해 데이터 가공/분석을 편리하게 한다.
     * `DataFrame` : 여러 개의 행과 열로 이루어진 2차원 데이터를 담는 데이터 구조체
         * column이 여러 개인 구조체 -> DataFrame = 여러 개의 Series
         * 2차원 데이터는 가장 이해하기 쉽고 효과적으로 데이터를 가공/처리할 수 있다.
     * `Series` : column이 하나인 데이터 구조체
     * `Index` : 개별 데이터를 고유하게 식별하는 key값

## 1. Pandas 시작 - 파일을 DataFrame으로 로딩, 기본 API
Pandas는 다양한 포맷으로 된 파일을 DataFrame으로 로딩할 수 있는 API를 제공한다.
* `read_csv()` : CSV(column을 `,`로 구분)을 변환하는 API
    * `sep` : default값은 `,`이며, 필드구분 문자를 말한다. (`read_csv(sep='\t'` == `read_table()`)
    * `filepath` : 로드하려는 데이터 파일의 경로를 포함한 파일명
* `read_table()` : `tab`으로 필드가 구분된 데이터를 변환하는 API
* `read_fwf()` : 고정 길이 기반의 column 포맷을 변환하는 API

In [1]:
import pandas as pd

titanic_df = pd.read_csv('train.csv')
print('titanic 변수 type : ', type(titanic_df))

titanic 변수 type :  <class 'pandas.core.frame.DataFrame'>

### 1.1. `pd.read_csv()`
* `pd.read_csv()`로 변환 시 첫번 째 줄에 있던 column 문자열이 DataFrame의 column이 된다. 
* 따로 매개변수 값을 할당하지 않으면 csv파일의 첫 번째 row를 DataFrame의 첫 번째 column으로 변환한다.   
* DataFrame의 가장 왼쪽에 있는 숫자는 Index며, DataFrame 내의 모든 데이터는 생성시 고유 키인 Index값을 가지게 된다.

### 1.2. `DataFrame.head()`
일부 데이터만 나타내고 싶을 때는 `DataFrame.head()`를 호출하여 맨 앞의 N개의 row만 반환한다.

In [2]:
titanic_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 1.3. `DataFrame.shape`
DataFrame의 행과 열의 크기를 알 수 있으며, 행과 열을 튜플 타입으로 반환한다.

In [3]:
print('DataFrame 크기 : ', titanic_df.shape)

DataFrame 크기 :  (891, 12)

### 1.4. `info()`와 `describe()`
#### 1.4.1. `info()`
* 총 데이터 건수와 데이터 타입
* Null 건수 (non-null건수와 총 데이터 건수를 통해 계산)

In [4]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

#### 1.4.2. `describe()`
* column별 숫자형 데이터 값의 n-percentile 분포도
* 평균값, 최대값, 최소값
* 대략적인 분포도를 알 수 있다.
* 해당 숫자 column이 숫자형 카테고리 column(특정 범주에 속하는 값을 코드화한 column)인지 판단할 수 있다.

In [5]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 1.5. `value_counts()`
DataFrame의 `[]`에 특정 column명을 입력하면 Series 타입의 특정 column 데이터 세트가 반환이 된다. 이 때 `value_counts()`를 호출하면 각각의 value값과 그에 해당하는 것들의 수를 가장 많은 것 순서대로 정렬하여 반환한다.

In [6]:
titanic_pclass = titanic_df['Pclass']     # Pclass를 Series 타입으로 반환
print(type(titanic_pclass))

value_cnts = titanic_df['Pclass'].value_counts()
print(value_cnts)

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

Series는 <strong>Index와 단 하나의 column</strong>으로 구성된 데이터 세트이다.    
이 때 가장 왼쪽에 0부터 시작하는 column이 <strong>Index</strong>이며, 그 옆의 column이 <strong>데이터값</strong>이다.

In [7]:
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

`value_counts()`는 Series에 정의되어 있으며, 반환 타입이 Series 객체이다.
* column 데이터 값 별 데이터 개수를 반환하므로 고유 column 값을 식별하는 기준으로 사용할 수 있다.
* Index는 DataFrame과 Series가 만들어진 후에도 변경이 가능하다.
* 모든 Index는 고유성이 보장되어야 한다.

In [8]:
value_cnts = titanic_df['Pclass'].value_counts()
print(type(value_cnts))
print(value_cnts)

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

## 2. DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환
DataFrame은 파이썬의 리스트, 딕셔너리 그리고 Numpy의 ndarray 등과 상호 변환이 가능하다. 특히 Scikitlearn의 많은 API는 DataFrame을 인자로 입력받을 수 있지만, 기본적으로 Numpy의 ndarray를 입력 인자로 사용하는 경우가 대부분이다. 그러므로 그러한 상호변환이 많이 발생한다.

### 2.1. Numpy의 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기
DataFrame은 다음과 같은 특징을 갖고 있다.
* column명을 가지고 있어 다른 데이터 타입보다 편하게 데이터 핸들링이 가능하다.
    * 이 때 column명을 지정해주지 않으면 자동으로 column명을 할당한다.
* data='리스트, 딕셔너리, ndarray', columns='column명 리스트'
* 행과 열을 가지는 2차원 데이터 이므로 <strong>2차원 이하의 데이터들</strong>만 변환할 수 있다.
    * 열의 개수 == col명의 개수
    * col명 리스트는 무조건 1개이다.

In [9]:
import numpy as np

col_name1 = ['col1']     # column명 지정 -> 1차원 즉, col이 1개이므로 col명도 1개 필요
list1 = [1, 2, 3]        # data값
arr1 = np.array(list1)
print('arr1 shape : ', arr1.shape)

# 리스트를 이용해 DataFrame을 생성
df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트로 만든 DataFrame : \n', df_list1)

# Numpy의 ndarray를 이용해 DataFrame 생성
df_arr1 = pd.DataFrame(arr1, columns=col_name1)
print('1차원 ndarray로 만든 DataFrame : \n', df_arr1)

arr1 shape :  (3,)
1차원 리스트로 만든 DataFrame :
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFrame :
    col1
0     1
1     2
2     3

In [10]:
# 3개의 col명이 필요
col_name2 = ['col1', 'col2', 'col3']

# 2행*3열 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환
list2 = [[1, 2, 3],
         [11, 12, 13]]
arr2 = np.array(list2)
print('array2 shape : ', arr2.shape)

df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame : \n', df_list2)

df_arr2 = pd.DataFrame(arr2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame : \n', df_arr2)

array2 shape :  (2, 3)
2차원 리스트로 만든 DataFrame :
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame :
    col1  col2  col3
0     1     2     3
1    11    12    13

딕셔너리를 DataFrame으로 변환 시 딕셔너리의 key값이 column명으로, value값이 column 데이터로 변환된다.

In [11]:
# key는 문자열 column명으로 매핑, value는 리스트 형(또는 dnarray) column 데이터로 매핑
dict = {'col1':[1, 11], 'col2':[2, 22], 'col3':[3, 33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame : \n', df_dict)

딕셔너리로 만든 DataFrame :
    col1  col2  col3
0     1     2     3
1    11    22    33

### 2.2. DataFrame을 Numpy의 ndarray, 리스트, 딕셔너리로 변환하기
데이터 핸들링 시 DataFrame으로 변환을 하여 처리를 하고 머신러닝 패키지 입력 인자로 넣기 위해 Numpy의 ndarray로 변환을 하는 경우가 많다.

In [12]:
# DataFrame을 ndarray로 변환
arr3 = df_dict.values      # data값을 ndarray 타입으로 반환
print('df_dict.values 타입 : ', type(arr3), ', df_dict.values shape : ', arr3.shape)
print(arr3)

df_dict.values 타입 :  <class 'numpy.ndarray'> , df_dict.values shape :  (2, 3)
[[ 1  2  3]
 [11 22 33]]

In [13]:
# DataFrame을 리스트로 반환
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타임 : ', type(list3))
print(list3)

# DataFrame을 딕셔너리로 반환
dict3 = df_dict.to_dict('list')     # 딕셔너리 value값 타입 지정
print('\n df_dict.to_dict() 타입 : ', type(dict3))
print(dict3)

df_dict.values.tolist() 타임 :  <class 'list'>
[[1, 2, 3], [11, 22, 33]]

 df_dict.to_dict() 타입 :  <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

## 3. DataFrame의 column 데이터 세트 생성과 수정
`[]` 연산자를 이용해 DataFrame의 column 데이터 세트의 생성과 수정을 할 수 있다.

In [14]:
titanic_df['Age_0'] = 0     # 새로운 column Age_0 추가 및 0으로 초기화
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

기존 column의 Series의 데이터를 이용해 새로운 column Series를 만들 수 있다.

In [15]:
titanic_df['Age_by_10'] = titanic_df['Age'] * 10
titanic_df['Family_Num'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_Num
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

DataFrame 내의 기존 column 값도 쉽게 일괄적으로 업데이트할 수 있다.

In [16]:
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_Num
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

## 4. DataFrame 데이터 삭제
`drop()` 메서드를 사용해 데이터를 삭제할 수 있다.
* `axis` : column 혹은 row를 삭제한다.
    * `axis=1` : column축 방향으로 column을 삭제한다.
    * `axis=0` : row축 방향으로 row를 삭제한다.
* `labels` : 특정 column 혹은 row를 지정한다.
    * `axis=1` : column명을 `labels`에 입력
    * `axis=0` : index를 `labels`에 입력
* `inplace` : 원 DataFrame의 column도 삭제할 건지를 결정한다.
    * 디폴트값은 False이며, 원 DataFrame의 데이터는 삭제하지 않고 삭제된 결과를 반환한다.
    * True일 경우, 원 DataFrame의 데이터를 삭제하고 None을 반환한다.

In [17]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_Num
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

리스트 형태로 삭제하고자 하는 column명을 `labels`에 입력하면 여러 개의 column을 삭제할 수 있다.

In [18]:
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_Num'], axis=1, inplace=True)
print('inplace=True로 drop 후 반환된 값 : ', drop_result)
titanic_df.head(3)

inplace=True로 drop 후 반환된 값 :  None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [19]:
# axis=0으로 row를 삭제
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(3))
titanic_df.drop([0, 1, 2], axis=0, inplace=True)

print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

## 5. Index 객체
Pandas의 Index 객체는 DataFrame, Series의 레코드를 고유하게 식별하는 객체이다. DataFrame, Series에서 Index 객체만 추출하려면 `DataFrame.Index`나 `Series.Index` 속성을 통해 가능하다.

In [20]:
# 원본 파일 다시 로딩
titanic_df = pd.read_csv('train.csv')

# Index 객체 추출
indexes = titanic_df.index
print(indexes)

# Index 객체를 실제 값 array로 반환
print('Index 객체 array값 : \n', indexes.values)

RangeIndex(start=0, stop=891, step=1)
Index 객체 array값 :
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

Index 객체는 1차원 array형태로 데이터를 가지고 있다. 또한 단일값 반환 및 슬라이싱도 가능하다.

In [21]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

하지만 한 번 만들어진 DataFrame 및 Series의 Index 객체는 변경할 수 없다.

In [22]:
indexes[0] = 5

TypeError: Index does not support mutable operations

Series 객체에 연산 함수(max, min, sum 등)를 적용시 Index는 연산에서 제외된다. Index는 오직 <strong>식별용</strong>으로만 사용된다.

In [23]:
series_fair = titanic_df['Fare']
print('Fair Series max값 : ', series_fair.max())
print('Fair Series sum값 : ', series_fair.sum())
print('sum() Fair Series : ', sum(series_fair))
print('Fair Series + 3 : \n', (series_fair+3).head(3))

Fair Series max값 :  512.3292
Fair Series sum값 :  28693.9493
sum() Fair Series :  28693.949299999967
Fair Series + 3 :
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

`reset_index()`메서드를 사용하면 새롭게 인덱스를 연속적인 숫자로 할당한다. 이 때 기존의 Index는 <strong>index</strong>라는 새로운 column으로 추가가 된다.    
주로 인덱스가 연속된 int 숫자형 데이터가 아닐 경우 주로 사용한다.

In [24]:
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [25]:
print('#### before reset_index ####')
value_cnts = titanic_df['Pclass'].value_counts()
print(value_cnts)
print('value_cnts 객체 변수 타입 : ', type(value_cnts))

new_value_cnts = value_cnts.reset_index(inplace=False)
print('#### after reset_index ####')
print(new_value_cnts)
print('new_value_cnts 객체 변수 타입 : ', type(new_value_cnts))

#### before reset_index ####
3    491
1    216
2    184
Name: Pclass, dtype: int64
value_cnts 객체 변수 타입 :  <class 'pandas.core.series.Series'>
#### after reset_index ####
   index  Pclass
0      3     491
1      1     216
2      2     184
new_value_cnts 객체 변수 타입 :  <class 'pandas.core.frame.DataFrame'>

이 때 `drop=True`로 설정하면 기존 인덱스는 새로운 column에 추가되지 않고 삭제된다.

## 6. 데이터 셀렉션 및 필터링
### 6.1. DataFrame의 []연산자
DataFrame의 `[]`안에는 다음과 같이 3가지가 들어갈 수 있다.
* <strong>column명</strong> : column명이나 여러 개의 column명이 들어가 있는 리스트
* <strong>인덱스로 변환가능한 표현식</strong> : 슬라이싱 연산 (이런 식의 방법은 쓰지 말 것!)
* <strong>boolean 인덱싱 표현</strong> : 비교연산자를 이용해 특정 조건을 만족하는 데이터의 인덱스 반환

In [26]:
print('단일 column 데이터 추출 : \n', titanic_df['Pclass'].head(3))
print('\n여러 column의 데이터 추출 : \n', titanic_df[['Survived', 'Pclass']].head(3))
print('[]안에 숫자 index는 KeyError 오류 발생 : \n', titanic_df[0])

단일 column 데이터 추출 :
 0    3
1    1
2    3
Name: Pclass, dtype: int64

여러 column의 데이터 추출 :
    Survived  Pclass
0         0       3
1         1       1
2         1       3

KeyError: 0

In [43]:
titanic_df[titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked  Name_len Child_Adult      Age_cat
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S        23       Adult      Student
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S        22       Adult  Young Adult
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S        24       Adult  Young Adult

### 6.2. DataFrame ix[] 연산자
ndarray의 `[]`연산자와 유사한 기능(=인덱싱)을 제공한다.
   * 행 위치 지정은 인덱스 값으로, 열 위치 지정은 column명과 column의 위치값으로 할 수 있다.
   * 가독성이 떨어져 Pandas에서 사라질 예정 -> 사용시 DeprecationWarning 출력

In [44]:
print('column 위치 기반 인덱싱 데이터 추출 : ', titanic_df.ix[0,2])
print('column 명 기반 인덱싱 데이터 추출 : ', titanic_df.ix[0, 'Pclass'])

column 위치 기반 인덱싱 데이터 추출 :  3
column 명 기반 인덱싱 데이터 추출 :  3

C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [45]:
data = {
        'Name':['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
        'Year':[2011, 2016, 2015, 2015],
        'Gender':['Male', 'Female', 'Male', 'Male']
       }
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [46]:
n_iter = 30

print(data_df.ix[0, 0])
print(data_df.ix['one', 0])
print(data_df.ix[3, 'Name'])
print("="*n_iter)
print(data_df.ix[0:2, [0,1]])
print("="*n_iter)
print(data_df.ix[0:2, 0:3])
print("="*n_iter)
print(data_df.ix[0:3, ['Name', 'Year']])
print("="*n_iter)
print(data_df.ix[:])
print("="*n_iter)
print(data_df.ix[:, :])
print("="*n_iter)
print(data_df.ix[data_df.Year >= 2014])

C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.
C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """
C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  import sys
C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:9: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':
C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:11: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  # This is added back by InteractiveShellApp.init_path()
C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:13: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  del sys.path[0]
C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:15: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  from ipykernel import kernelapp as app
C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:17: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

Chulmin
Chulmin
Soobeom
==============================
         Name  Year
one   Chulmin  2011
two  Eunkyung  2016
==============================
         Name  Year  Gender
one   Chulmin  2011    Male
two  Eunkyung  2016  Female
==============================
           Name  Year
one     Chulmin  2011
two    Eunkyung  2016
three  Jinwoong  2015
==============================
           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male
==============================
           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male
==============================
           Name  Year  Gender
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

### 6.3. 명칭 기반 인덱싱과 위치 기반 인덱싱 구분
* 명칭(Label) 기반 인덱싱 : column의 명칭을 기반으로 위치를 지정하는 방식
* 위치(Position) 기반 인덱싱 : 0에서 출발하여 가로축, 세로축 좌표 기반의 행과 열 위치를 기반으로 데이터를 지정하는 방식

In [47]:
# data_df를 reset_index()로 새로운 숫자형 인덱스를 생성
data_df_reset = data_df.reset_index()
data_df_reset = data_df_reset.rename(columns={'index':'old_index'})

# 인덱스 값에 1을 더해서 1부터 시작하는 새로운 인덱스 값 생성
data_df_reset.index = data_df_reset.index + 1
data_df_reset

  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  Jinwoong  2015    Male
4      four   Soobeom  2015    Male

DataFrame의 인덱스값은 <strong>명칭 기반 인덱싱</strong>이라고 봐야 한다.    
`ix[]`는 명칭인지 위치기반인지 헷갈릴 우려가 있으므로 명칭 기반 인덱싱을 쓰고 싶으면 `loc[]`를, 위치 기반 인덱싱을 쓰고 싶으면 `iloc[]`을 사용한다.

In [48]:
data_df_reset.ix[0, 1]     # 인덱스 값이 0인 key는 찾을 수 없으므로 오류를 출력

C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

KeyError: 0

### 6.4. DataFrame `iloc[]` 연산자

`iloc[]`은 위치 기반 인덱싱만 허용한다. 그러므로 행과 열 값으로 `int형`나 `int형 슬라이싱`, `팬시 리스트 값`을 입력해주어야 한다.
그냥 우리가 아는 행렬에서 좌표로 각 요소에 접근하는 방법과 동일하다.

In [55]:
data_df.iloc[0, 0]

'Chulmin'

`iloc[]`에 <strong>열</strong>에 인덱싱이 아닌 명칭을 입력하거나 <strong>행</strong>에 문자열 인덱스를 입력하면 오류가 발생한다.

In [56]:
data_df.iloc[0, 'Name']
data_df.iloc['one', 0]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [57]:
# 앞의 예제 적용
data_df_reset.iloc[0, 1]

'Chulmin'

### 6.5. DataFrame `loc[]` 연산자
`loc[]`는 명칭 기반으로 데이터를 추출한다. 따라서 행 위치에는 우리가 정의한 <strong>DataFrame index값</strong>을, 열 위치에는 <strong>column명</strong>을 입력해주어야 한다.

In [58]:
data_df.loc['one', 'Name']

'Chulmin'

In [59]:
data_df_reset.loc[1, 'Name']

'Chulmin'

In [60]:
# index값에서 0으로 정의한 것이 없으므로 오류를 출력
data_df_reset.loc[0, 'Name']

KeyError: 0

`loc[]`는 명칭 기반 인덱싱이기 때문에 명칭이 숫자형이 아닐 수 있으므로 슬라이싱(:)시 종료값까지 포함한다.

In [70]:
print('명칭 기반 ix 슬라이싱\n', data_df.ix['one':'two', 'Name'], '\n')
print('위치 기반 iloc 슬라이싱\n', data_df.iloc[0:1, 0], '\n')
print('명칭 기반 loc 슬라이싱\n', data_df.loc['one':'two', 'Name'], '\n')

명칭 기반 ix 슬라이싱
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

위치 기반 iloc 슬라이싱
 one    Chulmin
Name: Name, dtype: object

명칭 기반 loc 슬라이싱
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [71]:
print(data_df_reset.loc[1:2, 'Name'])     # 2를 포함
print(data_df.ix[1:2, 'Name'])            # 위치 기반 슬라이싱 : 2를 포함하지 않음

1     Chulmin
2    Eunkyung
Name: Name, dtype: object
two    Eunkyung
Name: Name, dtype: object

C:\Users\round\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

### 6.6.  불린 인덱싱
`[]`, `ix[]`, `loc[]`에서 지원한다. 하지만, `iloc[]`는 int형만 지원하기 떄문에 불린 인덱싱이 불가능하다.

In [72]:
titanic_df = pd.read_csv('train.csv')
titanic_bool = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_bool))
titanic_bool

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

In [73]:
titanic_df[titanic_df['Age'] > 60][['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [74]:
titanic_df.loc[titanic_df['Age'] > 60, ['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [75]:
# 여러 개의 조건도 추가 가능
titanic_df[(titanic_df['Age'] > 60) & (titanic_df['Pclass'] == 1) & (titanic_df['Sex'] == 'female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [76]:
# 개별 조건을 변수에 할당하고 이들 변수를 결합해서 수행 가능
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass'] == 1
cond3 = titanic_df['Sex'] == 'female'
titanic_df[cond1 & cond2 & cond3]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

## 7. 정렬, Aggregation 함수, GroupBy 적용
### 7.1. DataFrame, Series의 정렬 - sort_values()
`sort_values()`는 DataFrame과 Series를 정렬한다.
* `by` : 특정 column을 입력하면 해당 column을 정렬한다.
* `ascending` : True면 오름차순, False면 내림차순으로 정렬한다. (기본은 True)
* `inplace` : True면 원 DataFrame을 변환 그리고 None을 반환하고, False면 원 DataFrame을 변환하지 않고 변화된 DataFrame을 반환한다. (기본은 False)

In [77]:
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [78]:
# 여러 개의 column을 내림차순 정렬
titanic_sorted = titanic_df.sort_values(by=['Pclass', 'Name'], ascending=False)
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868          869         0       3  van Melkebe...  male   NaN      0      0    345777   9.5   NaN        S
153          154         0       3  van Billiar...  male  40.5      0      2  A/5. 851  14.5   NaN        S
282          283         0       3  de Pelsmaek...  male  16.0      0      0    345778   9.5   NaN        S

### 7.2. Aggregation 함수 적용
`min()`, `max()`, `sum()`, `count()`가 있으며, DataFrame의 경우 DataFrame에서 호출할 경우 모든 column에 각각 aggregation 함수를 적용한다.

`count()` 메서드는 모든 column의 데이터 개수를 세서 반환한다.

In [79]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

특정 column에 aggregation 함수를 적용하기 위해서는 DataFrame에 대상 column들만 추출하여 aggregation 함수를 적용하면 된다.

In [80]:
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

### 7.3. groupby() 적용

`by`에 특정 column값을 입력하면 해당 column값으로 데이터가 다시 grouping이 된다. 이 때, DataFrame에 `groupby()`를 호출하면 <strong>DataFrameGroupBy</strong> 타입의 객체를 반환한다.

In [81]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

DataFrame에 `groupby()`를 호출해 반환된 결과에 `aggregation` 함수를 호출하면 `groupby()` 대상 column을 제외한 모든 column(해당 column으로 분류하기 때문)에 해당 `aggregation` 함수를 적용한다.

In [82]:
titanic_groupby = titanic_df.groupby('Pclass').count()   # Pclass로 분류하되 나머지 feature의 값들은 합침
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

특정 column에만 aggregation 함수를 적용하고 싶다면 반환된 `DataFrameGroupBy` 객체에 해당 column을 필터링 한 뒤 적용해야 한다.

In [83]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()     # PassengerId와 Survived에만 적용
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

한 column에 여러 개의 aggregation함수를 쓰고 싶을 때 `agg()` 함수를 사용하면 된다.

In [84]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

여러 개의 column에 서로 다른 aggregation 함수를 적용하고 싶을 경우 `agg()` 내에 입력값으로 딕셔너리 타입으로 `column명:aggregation함수명`을 넣어주면 된다.

In [85]:
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

## 8. 결손 데이터 처리하기
결손 데이터(missing data)란 column에 값이 없는 즉, NULL(Numpy로는 NaN)인 경우를 말한다. 머신러닝 알고리즘은 NaN 값을 처리하지 못하므로 이를 다른 값으로 대체를 해야한다.    
NaN 여부를 확인하고 싶을 때는 `isna()`를, NaN값을 다른 값으로 대체하고 싶을 때는 `fillna()`를 사용한다.

### 8.1. `isna()`로 결손 데이터 여부 확인
DataFrame에 `isna()`를 호출하면 모든 column의 값이 NaN인지 아닌지를 반환한다.

In [86]:
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

`isna()`의 결과에 `sum()`함수로 결손 데이터의 개수를 구할 수 있다.

In [87]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### 8.2. `fillna()`로 결손 데이터 대체하기
`fillna()`함수를 사용해 결손 데이터를 편리하게 다른 값으로 대체할 수 있다.   
이 때 `fillna()`함수는 실제 데이터 세트에 영향을 주지 않으므로, 값을 변경하고 싶다면 <strong>반환 값을 다시 대입</strong>해주거나 <strong>`inplace=True`로 설정</strong>해주어야 한다.

In [88]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

## 9. apply lambda식으로 데이터 가공
Pandas는 `apply`함수에 lambda식을 결합하여 DataFrame이나 Series의 레코드별로 데이터를 가공할 수 있도록 한다. 특히 복잡한 데이터를 가공해야할 경우 유용하다.

lambda식은 `:`을 기준으로 왼쪽에는 <strong>입력인자</strong>를, 오른쪽에는 <strong>반환될 입력 인자의 계산식</strong>을 넣어서 함수 선언 및 처리를 한 줄의 식으로 쉽게 변환하는 식이다.

In [89]:
lambda_square = lambda x : x ** 2
print('3의 제곱근 : ', lambda_square(3))

3의 제곱근 :  9

lambda식에 여러 개의 값을 입력하고 싶은 경우 `map()`함수를 이용한다.

In [90]:
a = [1, 2, 3]
squares = map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

DataFrame의 `apply`에 lambda식을 적용해 데이터를 가공할 수 있다.

In [91]:
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))      # Name_len column을 추가
titanic_df[['Name', 'Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

lambda식에서 if-else 절을 사용하여 조금 더 복잡한 가공을 할 수 있다.    
이 때 lambda식의 `:` 오른 쪽에 반환값이 바로 나와야 하므로 반환값을 써준 다음 조건문을 써주어야 한다.

In [92]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

여러 개의 조건이 필요할 경우 else절에 ()를 넣어 ()내에 다시 if-else를 적용해주면 된다.    
이 때도 반환값이 if절보다 먼저 나와야 한다.

In [93]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x:'Child' if x<=15 else ('Adult' if x<=60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64

조건을 더 새분화하고 싶은 경우 별도의 함수를 정의한다.

In [94]:
# 나이에 따라 세분화된 분류를 수행하는 함수
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else: cat = 'Elderly'
    
    return cat 

# lambda 식에 위에서 생성한 get_category() 함수를 반환값으로 지정
# get_category(X)는 입력값으로 'Age' column 값을 받아서 해당하는 cat 반환
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult